{
  "_class_name": "EasyAnimateControlPipeline",
  "_diffusers_version": "0.31.0.dev0",
  "scheduler": [
    "diffusers",
    "FlowMatchEulerDiscreteScheduler"
  ],
  "text_encoder": [
    "transformers",
    "Qwen2VLForConditionalGeneration"
  ],
  "tokenizer": [
    "transformers",
    "Qwen2Tokenizer"
  ],
  "transformer": [
    "diffusers",
    "EasyAnimateTransformer3DModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLMagvit"
  ]
}
