{
    "_class_name": "AutoencoderKLMagvit",
    "_diffusers_version": "0.31.0.dev0",
    "act_fn": "silu",
    "block_out_channels": [
        128,
        256,
        512,
        512
    ],
    "down_block_types": [
        "SpatialDownBlock3D", 
        "SpatialTemporalDownBlock3D", 
        "SpatialTemporalDownBlock3D",
        "SpatialTemporalDownBlock3D"
    ],
    "force_upcast": true,
    "in_channels": 3,
    "mid_block_use_attention": false,
    "latent_channels": 16,
    "layers_per_block": 2,
    "norm_num_groups": 32,
    "out_channels": 3,
    "sample_size": 256,
    "scaling_factor": 0.7125,
    "slice_mag_vae": false,
    "slice_compression_vae": false,
    "cache_compression_vae": false,
    "cache_mag_vae": true,
    "use_tiling": false,
    "use_tiling_encoder": false,
    "norm_type": null,
    "use_tiling_decoder": false,
    "mini_batch_encoder": 4,
    "mini_batch_decoder": 1,
    "spatial_group_norm": true,
    "mid_block_attention_type": "spatial",
    "up_block_types": [
        "SpatialUpBlock3D", 
        "SpatialTemporalUpBlock3D", 
        "SpatialTemporalUpBlock3D",
        "SpatialTemporalUpBlock3D"
    ]
}
  