{
  "_class_name": "EasyAnimateTransformer3DModel",
  "_diffusers_version": "0.31.0",
  "activation_fn": "gelu-approximate",
  "add_noise_in_inpaint_model": true,
  "add_ref_latent_in_control_model": true,
  "add_norm_text_encoder": true,
  "after_norm": false,
  "attention_head_dim": 64,
  "clip_channels": null,
  "dropout": 0.0,
  "enable_clip_in_inpaint": false,
  "enable_text_attention_mask": true,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 48,
  "mmdit_layers": 18,
  "norm_elementwise_affine": true,
  "norm_eps": 1e-05,
  "num_attention_heads": 48,
  "num_layers": 36,
  "out_channels": 16,
  "patch_size": 2,
  "ref_channels": null,
  "resize_inpaint_mask_directly": true,
  "sample_height": 60,
  "sample_width": 90,
  "swa_layers": null,
  "text_embed_dim": 3584,
  "text_embed_dim_t5": null,
  "time_embed_dim": 512,
  "time_position_encoding_type": "3d_rope",
  "timestep_activation_fn": "silu"
}
